#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # newrelic_entity_tags.basic_dashboard[0m will be created
[0m  [32m+[0m[0m resource "newrelic_entity_tags" "basic_dashboard" {
      [32m+[0m[0m guid = (known after apply)
      [32m+[0m[0m id   = (known after apply)

      [32m+[0m[0m tag {
          [32m+[0m[0m key    = "terraform"
          [32m+[0m[0m values = [
              [32m+[0m[0m "true",
            ]
        }
    }

[1m  # newrelic_one_dashboard_json.basic_dashboard[0m will be created
[0m  [32m+[0m[0m resource "newrelic_one_dashboard_json" "basic_dashboard" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m guid       = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m json       = jsonencode(
            {
              [32m+[0m[0m description = [90mnull[0m[0m
              [32m+[0m[0m name        = "JSON Static - by Terraform test"
              [32m+[0m[0m pages       = [
                  [32m+[0m[0m {
                      [32m+[0m[0m description = [90mnull[0m[0m
                      [32m+[0m[0m name        = "Public API"
                      [32m+[0m[0m widgets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m layout            = {
                                  [32m+[0m[0m column = 1
                                  [32m+[0m[0m height = 4
                                  [32m+[0m[0m row    = 1
                                  [32m+[0m[0m width  = 3
                                }
                              [32m+[0m[0m linkedEntityGuids = [90mnull[0m[0m
                              [32m+[0m[0m rawConfiguration  = {
                                  [32m+[0m[0m facet           = {
                                      [32m+[0m[0m showOtherSeries = true
                                    }
                                  [32m+[0m[0m legend          = {
                                      [32m+[0m[0m enabled = true
                                    }
                                  [32m+[0m[0m nrqlQueries     = [
                                      [32m+[0m[0m {
                                          [32m+[0m[0m accountId = 3491187
                                          [32m+[0m[0m query     = "SELECT count(*) from Public_APICall facet api since 1 hour ago"
                                        },
                                    ]
                                  [32m+[0m[0m platformOptions = {
                                      [32m+[0m[0m ignoreTimeRange = false
                                    }
                                }
                              [32m+[0m[0m title             = ""
                              [32m+[0m[0m visualization     = {
                                  [32m+[0m[0m id = "viz.pie"
                                }
                            },
                          [32m+[0m[0m {
                              [32m+[0m[0m layout            = {
                                  [32m+[0m[0m column = 4
                                  [32m+[0m[0m height = 4
                                  [32m+[0m[0m row    = 1
                                  [32m+[0m[0m width  = 4
                                }
                              [32m+[0m[0m linkedEntityGuids = [90mnull[0m[0m
                              [32m+[0m[0m rawConfiguration  = {
                                  [32m+[0m[0m facet           = {
                                      [32m+[0m[0m showOtherSeries = false
                                    }
                                  [32m+[0m[0m legend          = {
                                      [32m+[0m[0m enabled = true
                                    }
                                  [32m+[0m[0m nrqlQueries     = [
                                      [32m+[0m[0m {
                                          [32m+[0m[0m accountId = 3491187
                                          [32m+[0m[0m query     = "SELECT average(duration) from Public_APICall facet api  timeseries 1 hour since 1 week ago"
                                        },
                                    ]
                                  [32m+[0m[0m platformOptions = {
                                      [32m+[0m[0m ignoreTimeRange = false
                                    }
                                  [32m+[0m[0m yAxisLeft       = {
                                      [32m+[0m[0m zero = true
                                    }
                                }
                              [32m+[0m[0m title             = "Avergae duration by API Call"
                              [32m+[0m[0m visualization     = {
                                  [32m+[0m[0m id = "viz.line"
                                }
                            },
                        ]
                    },
                ]
              [32m+[0m[0m permissions = "PUBLIC_READ_WRITE"
            }
        )
      [32m+[0m[0m permalink  = (known after apply)
      [32m+[0m[0m updated_at = (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m basic_dashboard = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @anu1101, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*